Tekla.Structures.Drawing.DimensionSetBaseAttributes
The DimensionSetBaseAttributes class is the base class for all dimension set attributes.
The class contains attributes that are common to all dimension sets.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Arrowhead
The arrowhead attributes of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Color
The color of the dimension line.
Throws System.ArgumentOutOfRangeException: Thrown when trying to set a non-standard color.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.TrueColor
The true color (RGB enabled) of the dimension line.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.TransparentBackground
The dimension text background transparency. (transparent/opaque)

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Format
The format attributes of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Placing
The placing attributes of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Text
The text attributes of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.#ctor
Creates a new default dimension set base attributes instance that loads standard attributes.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.#ctor(System.Boolean)
Creates a new default dimension set base attributes instance that loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.#ctor(System.String)
Creates a new dimension set base attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.#ctor(System.String,System.Boolean)
Creates a new dimension set base attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.
SkipLoadingAttributes: Defines if attribute loading should be skipped.